#!/usr/bin/env python
# coding: utf-8

# Задание 1
# Импортируйте библиотеку Numpy и дайте ей псевдоним np.
# Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

# In[1]:


import numpy as np


# In[2]:


a = np.array([
    [1, 6],
    [2, 8],
    [3, 11],
    [3, 10],
    [1, 7]
])

mean_a = a.mean(axis=0)
print(f'Среднее значение по каждому признаку = {mean_a}')

# var2 Получение массива а программно
b = [1, 2, 3, 3, 1]
c = [6, 8, 11, 10, 7]
a = np.dstack((b, c))[0]
print(a)


# Задание 2
# Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

# In[3]:


a_centered = a - mean_a
print(a_centered)


# Задание 3
# Найдите скалярное произведение столбцов массива a_centered. 
# В результате должна получиться величина a_centered_sp. 
# Затем поделите a_centered_sp на N-1, где N - число наблюдений.

# In[4]:


# print(a_centered[:, :1].T[0])
# print(a_centered[:,1:].T[0])
a_centered_sp = a_centered[:, :1].T[0] @ a_centered[:, 1:].T[0]
print(f'Скалярное произведение столбцов массива a_centerd:\n{a_centered_sp}')


# In[5]:


N = 0
for _ in a:
    N += 1

print(f'a_centered_sp/(N-1), где N - число наблюдений равно:\n{a_centered_sp/(N-1)}')


# Задание 4**
# Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. В задании 4(?) мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.
# Подробнее узнать о ковариации можно здесь:
# Выборочная ковариация и выборочная дисперсия — Студопедия
# 
# В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

# In[6]:


a_t = a.T
#print(a_t)

a_covar = np.cov(a_t)
#print(a_covar)
if a_covar[0, 1] == a_centered_sp/(N-1):
    print(True)

